app/controllers/movies_controller.rb

  def index

    redirect=false
    @sort = params[:sort] ? params[:sort] : session[:sort]
    @ratings = params[:ratings] ? params[:ratings] : session[:ratings]
    @all_ratings = Movie.pluck(:rating).uniq

    if (params[:sort] != @sort) || (params[:ratings] != @ratings)
       redirect=true

    end

    if @ratings.nil?
      @ratings = {}
      @all_ratings.each{|i| @ratings[i] = 1}
---
SELECT "movies"."rating" FROM "movies"
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY release_date